[
  {
    "Id": 1,
    "jobId": "1",
    "candidateId": "1",
    "coverLetter": "I am excited to apply for the Senior Frontend Developer position. With 6 years of experience in React development, I have successfully led multiple projects from conception to deployment. My expertise in TypeScript and modern frontend architecture makes me an ideal candidate for this role.",
    "resumeUrl": "/resumes/john-doe.pdf",
    "status": "shortlisted",
    "appliedAt": "2024-02-02T10:30:00Z",
    "updatedAt": "2024-02-10T14:20:00Z"
  },
  {
    "Id": 2,
    "jobId": "2",
    "candidateId": "4",
    "coverLetter": "I am writing to express my strong interest in the Backend Engineer position. My experience with Python, Django, and cloud platforms aligns perfectly with your requirements. I am passionate about building scalable systems and would love to contribute to your team.",
    "resumeUrl": "/resumes/sarah-wilson.pdf",
    "status": "reviewing",
    "appliedAt": "2024-02-06T09:15:00Z",
    "updatedAt": "2024-02-08T11:30:00Z"
  },
  {
    "Id": 3,
    "jobId": "3",
    "candidateId": "1",
    "coverLetter": "While my primary expertise is in frontend development, I have a strong interest in machine learning and have completed several online courses in the field. I believe my software engineering background combined with my ML knowledge makes me a strong candidate.",
    "resumeUrl": "/resumes/john-doe.pdf",
    "status": "rejected",
    "appliedAt": "2024-02-11T16:45:00Z",
    "updatedAt": "2024-02-15T10:00:00Z"
  },
  {
    "Id": 4,
    "jobId": "4",
    "candidateId": "8",
    "coverLetter": "I am thrilled about the Product Designer opportunity at Innovate Labs. My 4 years of UI/UX design experience, combined with my strong portfolio of successful projects, demonstrates my ability to create user-centered designs that drive engagement and satisfaction.",
    "resumeUrl": "/resumes/david-kim.pdf",
    "status": "interviewing",
    "appliedAt": "2024-02-13T14:20:00Z",
    "updatedAt": "2024-02-18T09:30:00Z"
  },
  {
    "Id": 5,
    "jobId": "5",
    "candidateId": "6",
    "coverLetter": "I am excited about the Full Stack Developer position at StartupCo. My experience with React, Node.js, and microservices architecture, combined with my passion for startups, makes me an excellent fit for this role. I thrive in fast-paced environments and enjoy wearing multiple hats.",
    "resumeUrl": "/resumes/alex-chen.pdf",
    "status": "applied",
    "appliedAt": "2024-02-16T11:00:00Z",
    "updatedAt": "2024-02-16T11:00:00Z"
  },
  {
    "Id": 6,
    "jobId": "1",
    "candidateId": "4",
    "coverLetter": "Although I am primarily a backend engineer, I have solid frontend skills and have worked extensively with React in previous roles. I am eager to expand my frontend expertise and contribute to building exceptional user experiences.",
    "resumeUrl": "/resumes/sarah-wilson.pdf",
    "status": "applied",
    "appliedAt": "2024-02-17T13:45:00Z",
    "updatedAt": "2024-02-17T13:45:00Z"
  },
  {
    "Id": 7,
    "jobId": "6",
    "candidateId": "6",
    "coverLetter": "I am very interested in the DevOps Engineer position. My experience with Kubernetes, AWS, and infrastructure automation aligns well with your requirements. I am passionate about building robust, scalable systems and improving deployment processes.",
    "resumeUrl": "/resumes/alex-chen.pdf",
    "status": "reviewing",
    "appliedAt": "2024-02-19T10:15:00Z",
    "updatedAt": "2024-02-21T15:30:00Z"
  },
  {
    "Id": 8,
    "jobId": "7",
    "candidateId": "1",
    "coverLetter": "I would love to mentor and work alongside junior developers in this role. While I am a senior developer, I believe in giving back to the community and would be excited to help grow the next generation of frontend developers.",
    "resumeUrl": "/resumes/john-doe.pdf",
    "status": "applied",
    "appliedAt": "2024-02-21T09:00:00Z",
    "updatedAt": "2024-02-21T09:00:00Z"
  }
]